master_thesis/literatures/drafts/thesis.tex
% Created 2010-11-16 Tue 11:38
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{ezfontcfg}
\usepackage[version=3]{mhchem}
\usepackage[colorlinks=true,bookmarksnumbered=true,linkcolor=blue,pdfstartview=FitH]{hyperref}

\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{ifthen}
\usepackage{hyperref}
\usepackage{mypgf}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Master's Thesis}

\begin{document}
\maketitle

Title: 
\textbf{Implementation of Contracting Curve Density Algorithm for Applications in Personal Robotics}
\\
\\
Abstract:
\\
Objective of the thesis is to implement a Contracting Curve Density (CCD) algorithm, a method for fitting 
parametric curve models to boundaries of image regions, in the ecosystem of Robot Operating System 
(ROS, \href{http://www.ros.org}{http://www.ros.org}).
After the implementation phase the algorithm is to be tested for the following applications:
\begin{itemize}
\item objects of daily use detection using CAD models objects,
\item tracking of objects of daily use,
\item robust camera to laser calibration using 2D to 3D curve correspondences.
\end{itemize}


\end{document}